wgy504/ihu/DA1458x_SDK/5.0.3/projects/target_apps/prod_test/prod_test/src/customer_prod.c
                // write xtal trimming value in otp
                word = value &0xFFFF;
                res = otp_write_words(0x7f8c, (uint8_t *)&word, 1);
                if (res != 0)
                    xtal_cal_status	= 0x03; 
     
                // write xtal trimming enable flag in otp
                word = 0x00000010;
                res = otp_write_words(0x7F78 , (uint8_t *)&word, 1);
                if (res != 0)
                    xtal_cal_status	= 0x03; 
            }
        }
        // The square pulse input pin could be the UART RX pin. 
        // So restore GPIO functionality here.
        set_pad_functions();
    }
		
	s.packet_type	= HCI_EVT_MSG_TYPE;
	s.event_code 	= HCI_CMD_CMPL_EVT_CODE; 
	s.length     	= 5;
    s.param0		= 0x01;
    if (ptr_data[0] == 0)
        s.xtrim_val	= GetWord16(CLK_FREQ_TRIM_REG);
    else if (ptr_data[0] == 6 || ptr_data[0] == 7)
    {
			s.xtrim_val		= xtal_cal_status;
    }
    else
        s.xtrim_val		= 0x0;
	s.param_opcode	= HCI_XTAL_TRIM_CMD_OPCODE;
	bufptr = (uint8_t*)&s;
	
	uart_write(bufptr, sizeof(struct msg_xtal_trim_cfm), NULL);
}	

void hci_rdtester_cmd(uint8_t *ptr_data)
{
	struct msg_rdtest_cfm s;
	uint8_t *bufptr;
	
	switch (ptr_data[0])
	{
    case RDTESTER_INIT:
        rdtest_initialize(ptr_data[1]);
        break;
    case RDTESTER_UART_CONNECT:
        rdtest_uart_connect((ptr_data[2] << 8) | ptr_data[1]);
        break;
    case RDTESTER_UART_LOOPBACK:
        rdtest_make_loopback(ptr_data[1]);
        break;
    case RDTESTER_VBAT_CNTRL:
        rdtest_vbatcontrol((ptr_data[2] << 8) | ptr_data[1]);
        rdtest_uart_connect((ptr_data[2] << 8) | ptr_data[1]);
        break;
    case RDTESTER_VPP_CNTRL:
        rdtest_vppcontrol(ptr_data[1]);
        break;
    case RDTESTER_RST_PULSE:
        rdtest_resetpulse((ptr_data[2] << 8) | ptr_data[1]);
        break;
    case RDTESTER_UART_PULSE:
        rdtest_pulse_to_uart((ptr_data[2] << 8) | ptr_data[1]);
        if (ptr_data[2] || ptr_data[1])
            rdtest_generate_pulse();
        else
            rdtest_select_pulsewidth(0);
        break;
    case RDTESTER_XTAL_PULSE:
        rdtest_generate_pulse();
        break;
    case RDTESTER_PULSE_WIDTH:
        rdtest_select_pulsewidth(ptr_data[1]);
        break;
    default:
        break;	
	}

	s.packet_type		= HCI_EVT_MSG_TYPE;
	s.event_code 		= HCI_CMD_CMPL_EVT_CODE; 
	s.length     		= 3;
	s.param0				= 0x01;
	s.param_opcode	= HCI_RDTESTER_CMD_OPCODE;
	
	bufptr = (uint8_t*)&s;							
	uart_write(bufptr, sizeof(struct msg_rdtest_cfm), NULL);					
}

#if HAS_AUDIO
void hci_audio_test_cmd(struct param_audio_test *ptr_data)
{
    struct msg_audio_test_cfm s;
    size_t struct_size;
    
    switch (ptr_data->operation) {
        case CMD__AUDIO_TEST_OP_START:
            struct_size = audio_start(&s, ptr_data->audio_packets);
            break;
        case CMD__AUDIO_TEST_OP_STOP:
            struct_size = audio_stop(&s);
            break;
        default:
            struct_size = sizeof(s) - sizeof(s.results) + sizeof(s.results.status);
            s.results.status = AUDIO_UNKNOWN_OPERATION;
            break;
    }

    s.packet_type               = HCI_EVT_MSG_TYPE;
    switch (ptr_data->operation) {
        case CMD__AUDIO_TEST_OP_START:
            s.event_code        = HCI_CMD_STATUS_EVT_CODE; 
            break;
        case CMD__AUDIO_TEST_OP_STOP:
        default:
            s.event_code        = HCI_CMD_CMPL_EVT_CODE;
            break;
    }
    s.length                    = struct_size - HCI_CCEVT_HDR_PARLEN;
    s.num_hci_cmd_packets       = HCI_CCEVT_NUM_CMD_PACKETS;
    s.param_opcode              = HCI_AUDIO_TEST_CMD_OPCODE;
        
    uart_write((uint8_t*) &s, struct_size, NULL);
}
#endif

void hci_play_tone_cmd(uint8_t *ptr_data)
{
    struct msg_play_tone_cfm s;
    uint8_t *bufptr;
    uint8_t ret = 0;

    if (ptr_data[1] == 0)
        ret = 1;

    if (ptr_data[1] > 0)
    {
        switch (ptr_data[0])
        {
            case 1: // start
                RESERVE_GPIO( GPIO_PWM0, GPIO_PWM0_PORT,  GPIO_PWM0_PIN, PID_PWM0);
                RESERVE_GPIO( GPIO_PWM1, GPIO_PWM1_PORT,  GPIO_PWM1_PIN, PID_PWM1);
                GPIO_ConfigurePin(GPIO_PWM0_PORT, GPIO_PWM0_PIN, OUTPUT, PID_PWM0, true);
                GPIO_ConfigurePin(GPIO_PWM1_PORT, GPIO_PWM1_PIN, OUTPUT, PID_PWM1, true);
                
                //Enables TIMER0,TIMER2 clock
                set_tmr_enable(CLK_PER_REG_TMR_ENABLED);

                //Sets TIMER0,TIMER2 clock division factor to 8
                set_tmr_div(CLK_PER_REG_TMR_DIV_8);

                // initilalize PWM with the desired settings
                timer0_init(TIM0_CLK_FAST, PWM_MODE_ONE, TIM0_CLK_DIV_BY_10);

                // set pwm Timer0 On, Timer0 'high' and Timer0 'low' reload values
                timer0_set(1000, 1000/ptr_data[1], 1000/ptr_data[1]);

                // start pwm0
                timer0_start();
                break;
            case 2: // stop
                // stop pwm0
                timer0_stop();
                break;
            default:
                break;
        }
    }

    s.packet_type       = HCI_EVT_MSG_TYPE;
    s.event_code        = HCI_CMD_CMPL_EVT_CODE; 
    s.length            = 5;
    s.param0            = 0x01;
    s.param_opcode      = HCI_PLAY_TONE_CMD_OPCODE;
    s.data              = ret;

    bufptr = (uint8_t*)&s;
    uart_write(bufptr, sizeof(struct msg_play_tone_cfm), NULL);
}

void hci_custom_action_cmd(uint8_t *ptr_data)
{
    struct msg_custom_action_cfm s;
    s.packet_type   = HCI_EVT_MSG_TYPE;
    s.event_code    = HCI_CMD_CMPL_EVT_CODE; 
    s.length        = 5;
    s.param0        = 0x01;
    s.param_opcode  = HCI_CUSTOM_ACTION_CMD_OPCODE;
    s.data          = ptr_data[0];
    uart_write((uint8_t*) &s, sizeof(s), NULL);
}

