wgy504/ihu/DA1458x_SDK/5.0.3/projects/target_apps/prod_test/prod_test/src/customer_prod.c
void hci_change_uart_pins_cmd(uint8_t *ptr_data)
{
    struct msg_uart_pins_cfm s;
    uint8_t *bufptr;
    uint16_t result = 0;

    if ((ptr_data[0] == GPIO_PORT_0) || (ptr_data[0] == GPIO_PORT_3)) {
        if (ptr_data[1] > GPIO_PIN_7)
            result = 1;
    }

    if ((ptr_data[2] == GPIO_PORT_0) || (ptr_data[2] == GPIO_PORT_3)) {
        if (ptr_data[3] > GPIO_PIN_7)
            result = 1;
    }

    if (ptr_data[0] == GPIO_PORT_1) {
        if (ptr_data[1] > GPIO_PIN_5)
            result = 1;
    }

    if (ptr_data[2] == GPIO_PORT_1) {
        if (ptr_data[3] > GPIO_PIN_5)
            result = 1;
    }

    if (ptr_data[0] == GPIO_PORT_2) {
        if (ptr_data[1] > GPIO_PIN_9)
            result = 1;
    }

    if (ptr_data[2] == GPIO_PORT_2) {
        if (ptr_data[3] > GPIO_PIN_9)
            result = 1;
    }

    s.packet_type       = HCI_EVT_MSG_TYPE;
    s.event_code        = HCI_CMD_CMPL_EVT_CODE; 
    s.length            = 5;
    s.param0            = 0x01;
    s.param_opcode      = HCI_CHANGE_UART_PINS_CMD_OPCODE;
    s.data              = result;

    bufptr = (uint8_t*)&s;
    uart_write(bufptr, sizeof(struct msg_uart_pins_cfm), NULL);
    
    for (volatile int i=0; i<2000; i++){}

#ifdef CONFIG_UART_GPIOS
    // Return previous UART GPIOs to default settings
    GPIO_ConfigurePin((GPIO_PORT) uart_sel_pins.uart_port_tx, (GPIO_PIN) uart_sel_pins.uart_tx_pin, INPUT, PID_GPIO, false);
    GPIO_ConfigurePin((GPIO_PORT) uart_sel_pins.uart_port_rx, (GPIO_PIN) uart_sel_pins.uart_rx_pin, INPUT, PID_GPIO, false);
    port_sel = 10;
#else
    #if defined(UART_P04_P05)
        GPIO_ConfigurePin(GPIO_PORT_0, GPIO_PIN_4, INPUT, PID_GPIO, false);
        GPIO_ConfigurePin(GPIO_PORT_0, GPIO_PIN_5, INPUT, PID_GPIO, false);
    #elif defined(UART_P00_P01)
        GPIO_ConfigurePin(GPIO_PORT_0, GPIO_PIN_0, INPUT, PID_GPIO, false);
        GPIO_ConfigurePin(GPIO_PORT_0, GPIO_PIN_1, INPUT, PID_GPIO, false);
    #elif defined(UART_P14_P15)
        GPIO_ConfigurePin(GPIO_PORT_1, GPIO_PIN_4, INPUT, PID_GPIO, false);
        GPIO_ConfigurePin(GPIO_PORT_1, GPIO_PIN_5, INPUT, PID_GPIO, false);
    #elif defined(UART_P04_P13)
        GPIO_ConfigurePin(GPIO_PORT_0, GPIO_PIN_4, INPUT, PID_GPIO, false);
        GPIO_ConfigurePin(GPIO_PORT_1, GPIO_PIN_3, INPUT, PID_GPIO, false);
    #else
        #error "=== No UART pin configuration selected in periph_setup.h ==="
    #endif // defined(UART_P04_P05)
#endif

    RESERVE_GPIO(UART1_TX, (GPIO_PORT) ptr_data[0], (GPIO_PIN) ptr_data[1], PID_UART1_TX);
    RESERVE_GPIO(UART1_TX, (GPIO_PORT) ptr_data[2], (GPIO_PIN) ptr_data[3], PID_UART1_RX);
    uart_sel_pins.uart_port_tx = ptr_data[0];
    uart_sel_pins.uart_tx_pin = ptr_data[1];
    uart_sel_pins.uart_port_rx = ptr_data[2];
    uart_sel_pins.uart_rx_pin = ptr_data[3];
    set_pad_uart();
}

void hci_fw_version_cmd(void)
{
	struct msg_fw_version_action s;
	
	s.packet_type		= HCI_EVT_MSG_TYPE;
	s.event_code 		= HCI_CMD_CMPL_EVT_CODE; 
	s.length     		= 69;
	s.param0				= 0x01;
	s.param_opcode	= HCI_FIRMWARE_VERSION_CMD_OPCODE;
	s.ble_ver_len  = sizeof(DA14580_SW_VERSION);
	strcpy(s.ble_ver, DA14580_SW_VERSION);
	s.app_ver_len  = sizeof(DA14580_SW_VERSION); //TODO sizeof(DA14580_REFDES_SW_VERSION);
	strcpy(s.app_ver, DA14580_SW_VERSION); //TODO DA14580_REFDES_SW_VERSION);

	uart_write((uint8_t*)&s, 8*sizeof(uint8_t), NULL);
	uart_finish_transfers();
	uart_write((uint8_t*)&s.ble_ver, 16, NULL);
	uart_finish_transfers();
	uart_write((uint8_t*)&s.ble_ver[16], 16, NULL);
	uart_finish_transfers();
	uart_write((uint8_t*)&s.app_ver, 16, NULL);
	uart_finish_transfers();
	uart_write((uint8_t*)&s.app_ver[16], 16, NULL);
	uart_finish_transfers();
}

#define BDADDR_FROM_OTP 0x7fd4     	// OTP address offset with BDADDR
#define XTAL16M_FROM_OTP 0x7f8c     // OTP address offset with XTAL16M
#define XTAL16M_ENABLE_OTP 0x7F78   // 

int otp_write_words(uint16_t otp_pos, uint8_t *val, uint8_t word_count)
{
    int cnt=100000;
    uint32 ret_value;

#define XPMC_MODE_STBY    0x0
#define XPMC_MODE_APROG   0x4
    
    uint32_t otp_val;
    
    SetBits16(CLK_AMBA_REG, OTP_ENABLE, 1);		// enable OTP clock	
    while ((GetWord16(ANA_STATUS_REG) & LDO_OTP_OK) != LDO_OTP_OK && cnt--)
        /* Just wait */;
    
    SetBits16(SPOTP_TEST_REG, LDO_OTP_WRITE, 1);		// bypass otp

    for(uint16 i=0; i < word_count; i++)
    {
        SetWord32 (OTPC_MODE_REG, XPMC_MODE_STBY);

        SetWord32 (OTPC_CELADR_REG, ((otp_pos+i*4)>>2)&0x3FFF);
        SetWord32 (OTPC_NWORDS_REG, 0x0);
        SetWord32 (OTPC_MODE_REG, (XPMC_MODE_APROG ));
     
        otp_val = val[i*4+3]<<24 | val[i*4+2]<<16 | val[i*4+1]<<8 | val[i*4];
        while (((ret_value = GetWord32(OTPC_STAT_REG)) & OTPC_STAT_FWORDS) == 0x800);
        SetWord32 (OTPC_FFPRT_REG, otp_val); // Write FIFO data

        do{
            ret_value=GetWord32(OTPC_STAT_REG);
        } while ((ret_value & OTPC_STAT_ARDY) != OTPC_STAT_ARDY);    
        if ((ret_value & OTPC_STAT_PERROR) == OTPC_STAT_PERROR) {
            if (((ret_value & OTPC_STAT_PERR_L) == OTPC_STAT_PERR_L) ||
            (ret_value & OTPC_STAT_PERR_U) == OTPC_STAT_PERR_U) {
                SetBits16(CLK_AMBA_REG, OTP_ENABLE, 0);     //disable OTP clock  
                    return -1;	
            }
        }				
    }
    SetBits16(CLK_AMBA_REG, OTP_ENABLE, 0);     //disable OTP clock    

    return 0;
}

void otp_read(uint16_t otp_pos, uint8_t *val, uint8_t len)
{
    int cnt=100000;

#define XPMC_MODE_MREAD   0x1
    uint8_t *otp_val = (uint8_t *)0x40000 + otp_pos;   //where in OTP header to read
    
    SetBits16(CLK_AMBA_REG, OTP_ENABLE, 1);		// enable OTP clock	
    while ((GetWord16(ANA_STATUS_REG) & LDO_OTP_OK) != LDO_OTP_OK && cnt--)
        /* Just wait */;
        
    // set OTP in read mode 
    SetWord32 (OTPC_MODE_REG,XPMC_MODE_MREAD);
    
    memcpy(val, otp_val, len);
    SetBits16(CLK_AMBA_REG, OTP_ENABLE, 0);     //disable OTP clock    
}

void hci_otp_rw_cmd(uint8_t* ptr_data)
{
	struct msg_otp_rw_cfm s;
	uint8_t* bufptr;
	
	s.packet_type	= HCI_EVT_MSG_TYPE;
	s.event_code 	= HCI_CMD_CMPL_EVT_CODE; 
    s.length        = 10;
    s.param0		= 0x01;
	s.param_opcode	= HCI_OTP_RW_CMD_OPCODE;
    s.action		= ptr_data[0];
	s.otp_val[0]    = 0;
	s.otp_val[1]    = 0;
	s.otp_val[2]    = 0;
	s.otp_val[3]    = 0;
	s.otp_val[4]    = 0;
	s.otp_val[5]    = 0;
	
    if(ptr_data[0] == 0)
    {
        otp_read(XTAL16M_FROM_OTP, s.otp_val, 2);
    }
    else if(ptr_data[0] == 2)
    {
        otp_read(BDADDR_FROM_OTP, s.otp_val, 6);
    }
    else if(ptr_data[0] == 4)
    {
        otp_read(XTAL16M_ENABLE_OTP, s.otp_val, 4);
    }
	else if(ptr_data[0] == 1)
    {
		uint32_t word = ptr_data[1] | ptr_data[2] << 8 ;
		otp_write_words(XTAL16M_FROM_OTP, (uint8_t *)&word, 1);
    }
    else if(ptr_data[0] == 3)
    {
		uint8_t buffer[8]; // contains space for 2 words
		
