wgy504/ihu/DA1458x_SDK/5.0.3/projects/target_apps/prod_test/prod_test/src/customer_prod.c
		memset(buffer, 0, 8);
		memcpy( buffer, &ptr_data[1], 6);
		otp_write_words(BDADDR_FROM_OTP, buffer, 2);
    }
	else if(ptr_data[0] == 5)
	{
		uint32_t word = 0x00000010;
		otp_write_words(XTAL16M_ENABLE_OTP , (uint8_t *)&word, 1);
	}
	
	bufptr = (uint8_t*)&s;							
	// struct msg_otp_rw_cfm contains 1 padding byte at the end
	// that must not be sent
	uart_write(bufptr,sizeof(struct msg_otp_rw_cfm) - 1,NULL);
}	               

static void *ptr_msg_otp_read_cfm = 0;

static void tx_msg_otp_read_cfm_completed (uint8_t status)
{
	ke_free(ptr_msg_otp_read_cfm);
	ptr_msg_otp_read_cfm = 0;
}
	
void hci_otp_read_cmd(uint8_t *ptr_data)
{
	uint16_t otp_address; // must be word aligned 
	uint8_t word_count;
	struct msg_otp_read_cfm *msg;	
	otp_address = ptr_data[0] | (ptr_data[1] << 8);
	word_count = ptr_data[2];
	
	msg = ke_malloc( sizeof(struct msg_otp_read_cfm) + word_count * sizeof(uint32_t), KE_MEM_NON_RETENTION);
	
	msg->packet_type = HCI_EVT_MSG_TYPE;
	msg->event_code  = HCI_CMD_CMPL_EVT_CODE; 
	msg->length      = 5 + word_count * sizeof(uint32_t) ;
	msg->param0      = 1;
	msg->param_opcode = HCI_OTP_READ_CMD_OPCODE;
	msg->status       = HCI_OTP_READ_CMD_STATUS_SUCCESS;
	msg->word_count   = word_count;	
	
	otp_read(otp_address, (uint8_t *) &msg->words[0], word_count * sizeof(uint32_t) );
	
	ptr_msg_otp_read_cfm = msg;		
	uart_write( (uint8_t *)ptr_msg_otp_read_cfm, sizeof(struct msg_otp_read_cfm) + word_count * sizeof(uint32_t), tx_msg_otp_read_cfm_completed);
}

void hci_otp_write_cmd(uint8_t *ptr_data)
{
	uint16_t otp_address; // must be word aligned 
	uint8_t word_count = 0;
	struct msg_otp_write_cfm msg;
	
	otp_address = ptr_data[0] | (ptr_data[1] << 8);
	word_count = ptr_data[2];
	
	// &ptr_data[3] points to the words
	otp_write_words(otp_address, &ptr_data[3], word_count);
	
	msg.packet_type  = HCI_EVT_MSG_TYPE;
	msg.event_code   = HCI_CMD_CMPL_EVT_CODE; 
	msg.length       = 5;
	msg.param0       = 1;
	msg.param_opcode = HCI_OTP_WRITE_CMD_OPCODE;
	msg.status       = HCI_OTP_WRITE_CMD_STATUS_SUCCESS;
	msg.word_count   = word_count;

	uart_write( (uint8_t *) &msg, sizeof(struct msg_otp_write_cfm), NULL);
}

void hci_register_rw_cmd(uint8_t *ptr_data)
{
    uint8_t operation = ptr_data[0];
    volatile void * reg_addr = 0;
    uint32_t value32 = 0;
    uint16_t value16 = 0;
    struct msg_register_rw_cfm msg;

    // initialize return message
	msg.packet_type  = HCI_EVT_MSG_TYPE;
	msg.event_code   = HCI_CMD_CMPL_EVT_CODE; 
	msg.length       = 9;
	msg.param0       = 1;
	msg.param_opcode = HCI_REGISTER_RW_CMD_OPCODE;
    msg.operation    = operation;
    msg.reserved     = 0;
	msg.data[0] = 0;
	msg.data[1] = 0;
	msg.data[2] = 0;
	msg.data[3] = 0;

    reg_addr = (volatile void *) ( ptr_data[1] | (ptr_data[2] << 8) | (ptr_data[3] << 16) | (ptr_data[4] << 24) );
	
    switch(operation)
	{
    case 0x00: // read_reg32
        value32 = GetWord32(reg_addr);
        msg.data[0] = value32 & 0xFF;
        msg.data[1] = (value32 >> 8) & 0xFF;
        msg.data[2] = (value32 >> 16) & 0xFF;
        msg.data[3] = (value32 >> 24) & 0xFF;
        break;        
    case 0x01: // write_reg32	
        value32 = ptr_data[5] | (ptr_data[6] << 8) | (ptr_data[7] << 16) | (ptr_data[8] << 24);
        SetWord32(reg_addr, value32 );
        break;        
    case 0x02: // read_reg16
        value16 = GetWord16(reg_addr);
        msg.data[0] = value16 & 0xFF;
        msg.data[1] = (value16 >> 8) & 0xFF;
        break;        
    case 0x03: // write_reg16
        value16 = ptr_data[5] | (ptr_data[6] << 8) ;
        SetWord16(reg_addr, value16 );
        break;        
	}

	uart_write( (uint8_t *) &msg, sizeof(struct msg_register_rw_cfm), NULL);
}
